function [Xtrue]=Route2D()
%function [Xtrue,X]=Route2D()
% MS的路线生成，匀速
%输出：-- Xtrue=(x,y)%轨迹变量矩阵，第一列为x，第二列为y；
%      -- X本意为带噪声的轨迹（未处理）
%输入：无
%轨迹生成方式：
%按照0.2m/s,10Hz生成5*10m^2的数据,移动总路程(2*7.5+π*2.5)m，
%共计22.854m(1143+7=375+393+375+7)点
% y=2.5;%x=2.5-10
% y=5+sqrt(6.25-(x-7.5)^2);%x=1-12.5,这里应该有正负
% y=7.5;%x=2.5-10

y1=2.5*ones(375,1);    %第一段距离
x1=(linspace(2.5,10,375))';  %等分直线再转为列向量

%第二段路程，或者采用方程进行计算
n = 392;       %等分393份（含起终点），匀速转动。πr/0.2*10≈392.70
t = linspace(-0.5*pi,0.5*pi,n+1);   %等分(右)半圆
rho = 2.5*ones(1,n+1);  %列矩阵存
%polar(t,rho);  %画极坐标图(t为角度，rho为长度)，按等分角度等分，可不画
[x2,y2] = pol2cart(t,rho);  %极坐标转直角坐标
x2=x2+10;
y2=y2+5;%坐标变换
%plot(x2,y2,'b-');
%axis equal;
y=[y1;y2'];%列向量拼接[y1;y2'],行向量拼接[y1' y2]
x=[x1;x2'];

y=[y;7.5*ones(375,1)];%叠加第三段路程
x=[x;linspace(10,2.5,375)'];



% plot(x,y,'r-'); %画轨迹图，可不画20181211
% title('真实轨迹');
% xlabel('x方向/m');
% ylabel('y方向/m');
% axis equal;

Xtrue=[x y];%存轨迹变量，第一列为想x第二列为y

